results/task#3/wrk_get.txt
leo@leo-VirtualBox:~/techpol/wrk_tests$ wrk -t4 -c200 -d30s -sget.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 1.699ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.632ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 1.652ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.136ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.03ms    2.26ms  48.16ms   93.94%
    Req/Sec   529.77      1.01k    5.55k    94.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.59ms
 75.000%    2.37ms
 90.000%    3.54ms
 99.000%    9.09ms
 99.900%   33.53ms
 99.990%   43.33ms
 99.999%   48.19ms
100.000%   48.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.074     0.000000            1         1.00
       0.655     0.100000         3950         1.11
       0.920     0.200000         7891         1.25
       1.145     0.300000        11821         1.43
       1.363     0.400000        15762         1.67
       1.585     0.500000        19709         2.00
       1.708     0.550000        21685         2.22
       1.849     0.600000        23653         2.50
       1.992     0.650000        25622         2.86
       2.163     0.700000        27593         3.33
       2.371     0.750000        29573         4.00
       2.493     0.775000        30544         4.44
       2.627     0.800000        31527         5.00
       2.787     0.825000        32512         5.71
       2.985     0.850000        33493         6.67
       3.237     0.875000        34481         8.00
       3.377     0.887500        34974         8.89
       3.537     0.900000        35463        10.00
       3.735     0.912500        35958        11.43
       3.959     0.925000        36447        13.33
       4.247     0.937500        36943        16.00
       4.419     0.943750        37187        17.78
       4.623     0.950000        37434        20.00
       4.863     0.956250        37680        22.86
       5.155     0.962500        37926        26.67
       5.599     0.968750        38174        32.00
       5.839     0.971875        38296        35.56
       6.127     0.975000        38420        40.00
       6.535     0.978125        38541        45.71
       7.103     0.981250        38665        53.33
       7.675     0.984375        38787        64.00
       8.095     0.985938        38848        71.11
       8.463     0.987500        38910        80.00
       8.823     0.989062        38972        91.43
       9.231     0.990625        39033       106.67
       9.751     0.992188        39095       128.00
      10.039     0.992969        39125       142.22
      11.479     0.993750        39157       160.00
      12.559     0.994531        39187       182.86
      14.175     0.995313        39218       213.33
      16.279     0.996094        39249       256.00
      16.863     0.996484        39264       284.44
      17.391     0.996875        39279       320.00
      20.879     0.997266        39295       365.71
      26.655     0.997656        39310       426.67
      31.999     0.998047        39326       512.00
      32.415     0.998242        39333       568.89
      32.799     0.998437        39341       640.00
      32.959     0.998633        39349       731.43
      33.311     0.998828        39357       853.33
      33.535     0.999023        39364      1024.00
      33.663     0.999121        39369      1137.78
      33.823     0.999219        39372      1280.00
      33.919     0.999316        39376      1462.86
      34.015     0.999414        39379      1706.67
      36.255     0.999512        39383      2048.00
      36.767     0.999561        39385      2275.56
      37.183     0.999609        39387      2560.00
      38.879     0.999658        39389      2925.71
      40.511     0.999707        39391      3413.33
      41.119     0.999756        39393      4096.00
      42.367     0.999780        39394      4551.11
      42.655     0.999805        39395      5120.00
      42.751     0.999829        39396      5851.43
      43.263     0.999854        39397      6826.67
      43.327     0.999878        39398      8192.00
      43.327     0.999890        39398      9102.22
      44.223     0.999902        39399     10240.00
      44.223     0.999915        39399     11702.86
      46.719     0.999927        39401     13653.33
      46.719     0.999939        39401     16384.00
      46.719     0.999945        39401     18204.44
      46.719     0.999951        39401     20480.00
      46.719     0.999957        39401     23405.71
      46.719     0.999963        39401     27306.67
      46.719     0.999969        39401     32768.00
      46.719     0.999973        39401     36408.89
      48.191     0.999976        39402     40960.00
      48.191     1.000000        39402          inf
#[Mean    =        2.032, StdDeviation   =        2.263]
#[Max     =       48.160, Total count    =        39402]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58931 requests in 30.25s, 3.72MB read
  Non-2xx or 3xx responses: 1
Requests/sec:   1948.14
Transfer/sec:    126.03KB