results/task#3/wrk_put.txt
leo@leo-VirtualBox:~/techpol/wrk_tests$ wrk -t4 -c200 -d30s -sput.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 2.514ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.289ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.265ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.264ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.08ms    2.77ms  51.58ms   94.97%
    Req/Sec   531.24    754.66     5.55k    96.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.50ms
 75.000%    2.26ms
 90.000%    3.65ms
 99.000%   12.87ms
 99.900%   37.89ms
 99.990%   48.19ms
 99.999%   51.62ms
100.000%   51.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.103     0.000000            1         1.00
       0.637     0.100000         3959         1.11
       0.887     0.200000         7897         1.25
       1.098     0.300000        11841         1.43
       1.297     0.400000        15806         1.67
       1.497     0.500000        19739         2.00
       1.607     0.550000        21714         2.22
       1.730     0.600000        23683         2.50
       1.865     0.650000        25656         2.86
       2.035     0.700000        27623         3.33
       2.261     0.750000        29600         4.00
       2.403     0.775000        30592         4.44
       2.579     0.800000        31576         5.00
       2.773     0.825000        32556         5.71
       3.019     0.850000        33544         6.67
       3.293     0.875000        34535         8.00
       3.469     0.887500        35022         8.89
       3.649     0.900000        35517        10.00
       3.857     0.912500        36011        11.43
       4.091     0.925000        36503        13.33
       4.423     0.937500        36998        16.00
       4.615     0.943750        37243        17.78
       4.863     0.950000        37491        20.00
       5.183     0.956250        37736        22.86
       5.511     0.962500        37983        26.67
       5.895     0.968750        38228        32.00
       6.111     0.971875        38353        35.56
       6.447     0.975000        38475        40.00
       7.087     0.978125        38599        45.71
       8.199     0.981250        38722        53.33
       9.175     0.984375        38846        64.00
       9.807     0.985938        38907        71.11
      10.575     0.987500        38969        80.00
      11.831     0.989062        39030        91.43
      13.839     0.990625        39092       106.67
      15.335     0.992188        39153       128.00
      16.295     0.992969        39185       142.22
      17.551     0.993750        39215       160.00
      19.263     0.994531        39246       182.86
      21.631     0.995313        39277       213.33
      23.183     0.996094        39307       256.00
      24.319     0.996484        39323       284.44
      26.223     0.996875        39338       320.00
      29.695     0.997266        39354       365.71
      33.567     0.997656        39369       426.67
      35.775     0.998047        39384       512.00
      36.223     0.998242        39392       568.89
      36.639     0.998437        39400       640.00
      37.247     0.998633        39408       731.43
      37.535     0.998828        39415       853.33
      37.919     0.999023        39423      1024.00
      38.239     0.999121        39427      1137.78
      38.367     0.999219        39431      1280.00
      38.591     0.999316        39435      1462.86
      39.551     0.999414        39438      1706.67
      40.127     0.999512        39442      2048.00
      40.863     0.999561        39445      2275.56
      41.023     0.999609        39446      2560.00
      42.527     0.999658        39448      2925.71
      42.719     0.999707        39450      3413.33
      43.967     0.999756        39452      4096.00
      44.479     0.999780        39453      4551.11
      45.631     0.999805        39454      5120.00
      46.431     0.999829        39455      5851.43
      47.167     0.999854        39456      6826.67
      48.191     0.999878        39457      8192.00
      48.191     0.999890        39457      9102.22
      48.959     0.999902        39458     10240.00
      48.959     0.999915        39458     11702.86
      49.567     0.999927        39459     13653.33
      49.567     0.999939        39459     16384.00
      49.567     0.999945        39459     18204.44
      51.167     0.999951        39460     20480.00
      51.167     0.999957        39460     23405.71
      51.167     0.999963        39460     27306.67
      51.167     0.999969        39460     32768.00
      51.167     0.999973        39460     36408.89
      51.615     0.999976        39461     40960.00
      51.615     1.000000        39461          inf
#[Mean    =        2.077, StdDeviation   =        2.767]
#[Max     =       51.584, Total count    =        39461]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59383 requests in 30.00s, 3.79MB read
Requests/sec:   1979.50
Transfer/sec:    129.52KB